app/views/tenants/_form.html.erb

SELECT "properties".* FROM "properties"
---
      <h2><%= pluralize(@tenant.errors.count, "error") %> prohibited this tenant from being saved:</h2>
   <%= f.collection_select :category_id,Property.all, :id, :name %>