app/views/leases/_form.html.erb

    <%= f.label :tenant_id %><br />
    <%= f.select :tenant, options_from_collection_for_select(@tenants, 'id', 'name') %>
---
SELECT "tenants".* FROM "tenants"

    <%= f.label :property_id %><br />
    <%= f.select :property, options_from_collection_for_select(@properties, 'id', 'address_line_1') %>
---
SELECT "properties".* FROM "properties"