app/controllers/interestonlymortgagecalculators_controller.rb

SELECT "interestonlymortgagecalculators".* FROM "interestonlymortgagecalculators"
---
  def index
    @interestonlymortgagecalculators = Interestonlymortgagecalculator.all