app/controllers/tenants_controller.rb

  def index
    @tenants = Tenant.all
---
SELECT "tenants".* FROM "tenants"

  def show
    @tenant = Tenant.find(params[:id])
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT 1  [["id", "showlease"]]

def showlease
@lease = Lease.find(params[:id])
---
SELECT "leases".* FROM "leases" WHERE "leases"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @tenant = Tenant.new
    @property = Property.all
---
SELECT "properties".* FROM "properties"

  def edit
    @tenant = Tenant.find(params[:id])
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tenant = Tenant.new(params[:tenant])

    respond_to do |format|
      if @tenant.save
---
INSERT INTO "tenants" ("created_at", "email", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 21 Mar 2013 15:41:07 UTC +00:00], ["email", ""], ["name", ""], ["phone", ""], ["updated_at", Thu, 21 Mar 2013 15:41:07 UTC +00:00]]